derskop/zephyr/include/zephyr/dt-bindings/pinctrl/n32g45x-pinctrl.h
/*
 * Copyright (c) 2024 Nations Technologies Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_N32G45X_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_N32G45X_PINCTRL_H_

/*
 * N32G45x pinmux bit fields (remap encoded in pinmux):
 *   mode[0:1]     ALTERNATE / GPIO_IN / ANALOG / GPIO_OUT
 *   line[2:5]     pin number 0-15
 *   port[6:9]     port number, 'A'-based
 *   rm[10:19]     remap opcode (see N32G45X_REMAP), 0 = no remap
 */
#define N32G45X_MODE_SHIFT   0U
#define N32G45X_MODE_MASK    0x3U
#define N32G45X_LINE_SHIFT   2U
#define N32G45X_LINE_MASK    0xFU
#define N32G45X_PORT_SHIFT   6U
#define N32G45X_PORT_MASK    0xFU
#define N32G45X_RM_SHIFT     10U
#define N32G45X_RM_MASK      0x3FFU

/* Mode enums */
#define ALTERNATE  0x0 /* Alternate function output */
#define GPIO_IN    0x1 /* Input */
#define ANALOG     0x2 /* Analog input */
#define GPIO_OUT   0x3 /* General purpose output */

/*
 * Remap opcode bit fields (10 bits, stored in pinmux[10:19]):
 *   val[0:1]     remap value (0-3)
 *   w[2]         remap field width: 0 = 1 bit, 1 = 2 bits
 *   reg[3:4]     remap register:
 *                0 = AFIO_RMP_CFG, 1 = AFIO_RMP_CFG3, 2 = AFIO_RMP_CFG4
 *                3 = remap bits split across two registers
 *   bit[5:9]     bit position of the remap field in the register
 */
#define N32G45X_RM_VAL_SHIFT 0U
#define N32G45X_RM_VAL_MASK  0x3U
#define N32G45X_RM_W_SHIFT   2U
#define N32G45X_RM_W_MASK    0x1U
#define N32G45X_RM_REG_SHIFT 3U
#define N32G45X_RM_REG_MASK  0x3U
#define N32G45X_RM_BIT_SHIFT 5U
#define N32G45X_RM_BIT_MASK  0x1FU

/* Decode accessors for the remap opcode */
#define N32G45X_RM_VAL_GET(rmap) \
	(((rmap) >> N32G45X_RM_VAL_SHIFT) & N32G45X_RM_VAL_MASK)
#define N32G45X_RM_W_GET(rmap) \
	(((rmap) >> N32G45X_RM_W_SHIFT) & N32G45X_RM_W_MASK)
#define N32G45X_RM_REG_GET(rmap) \
	(((rmap) >> N32G45X_RM_REG_SHIFT) & N32G45X_RM_REG_MASK)
#define N32G45X_RM_BIT_GET(rmap) \
	(((rmap) >> N32G45X_RM_BIT_SHIFT) & N32G45X_RM_BIT_MASK)

/* Remap register selectors */
#define N32G45X_RMP_CFG   0U
#define N32G45X_RMP_CFG3  1U
#define N32G45X_RMP_CFG4  2U
/* Split remap: SPI1 (RMP_CFG.0 + RMP_CFG3.18) and USART2 (RMP_CFG.3 +
 * RMP_CFG3.19) have their remap bits spread over two registers. The bit
 * field carries the position of the low bit (0 for SPI1, 3 for USART2). */
#define N32G45X_RMP_SPLIT 3U

/**
 * Encode a remap opcode: value, field width (0 = 1 bit, 1 = 2 bits),
 * register selector and bit position.
 */
#define N32G45X_REMAP(val, w, reg, bit)                                    \
	((((val) & N32G45X_RM_VAL_MASK) << N32G45X_RM_VAL_SHIFT) |          \
	 (((w) & N32G45X_RM_W_MASK) << N32G45X_RM_W_SHIFT) |                \
	 (((reg) & N32G45X_RM_REG_MASK) << N32G45X_RM_REG_SHIFT) |          \
	 (((bit) & N32G45X_RM_BIT_MASK) << N32G45X_RM_BIT_SHIFT))

/** Encode a pinmux value: port ('A'-based), line, mode and remap opcode. */
#define N32G45X_PINMUX(port, line, mode, remap)                            \
	(((((port) - 'A') & N32G45X_PORT_MASK) << N32G45X_PORT_SHIFT) |     \
	 (((line) & N32G45X_LINE_MASK) << N32G45X_LINE_SHIFT) |             \
	 (((mode) & N32G45X_MODE_MASK) << N32G45X_MODE_SHIFT) |             \
	 (((remap) & N32G45X_RM_MASK) << N32G45X_RM_SHIFT))

/** No remap sentinel: the device cannot be remapped. */
#define NO_REMAP 0

/*
 * Remap opcodes for AFIO_RMP_CFG, defined in bit order
 * (bit 0, 1, 2, 3, 4, 6, 8, 10, 12, 13, 15, 16, 17, 18, 19, 20, 23).
 * SW_JTAG_CFG (bits 26:24) is a board-level field and is not defined here.
 */
#define SPI1_REMAP0       N32G45X_REMAP(0, 0, N32G45X_RMP_SPLIT, 0)
#define SPI1_REMAP1       N32G45X_REMAP(1, 0, N32G45X_RMP_SPLIT, 0)
#define SPI1_REMAP2       N32G45X_REMAP(2, 0, N32G45X_RMP_SPLIT, 0)
#define SPI1_REMAP3       N32G45X_REMAP(3, 0, N32G45X_RMP_SPLIT, 0)
#define I2C1_REMAP0       N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 1)
#define I2C1_REMAP1       N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 1)
#define USART1_REMAP0     N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 2)
#define USART1_REMAP1     N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 2)
#define USART2_REMAP0     N32G45X_REMAP(0, 0, N32G45X_RMP_SPLIT, 3)
#define USART2_REMAP1     N32G45X_REMAP(1, 0, N32G45X_RMP_SPLIT, 3)
#define USART2_REMAP2     N32G45X_REMAP(2, 0, N32G45X_RMP_SPLIT, 3)
#define USART2_REMAP3     N32G45X_REMAP(3, 0, N32G45X_RMP_SPLIT, 3)
#define USART3_REMAP0     N32G45X_REMAP(0, 1, N32G45X_RMP_CFG, 4)
#define USART3_REMAP1     N32G45X_REMAP(1, 1, N32G45X_RMP_CFG, 4)
#define USART3_REMAP2     N32G45X_REMAP(3, 1, N32G45X_RMP_CFG, 4)
#define TIM1_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG, 6)
#define TIM1_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG, 6)
#define TIM1_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG, 6)
#define TIM1_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG, 6)
#define TIM2_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG, 8)
#define TIM2_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG, 8)
#define TIM2_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG, 8)
#define TIM2_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG, 8)
#define TIM3_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG, 10)
#define TIM3_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG, 10)
#define TIM3_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG, 10)
#define TIM4_REMAP0       N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 12)
#define TIM4_REMAP1       N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 12)
#define CAN1_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG, 13)
#define CAN1_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG, 13)
#define CAN1_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG, 13)
#define CAN1_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG, 13)
#define PD01_REMAP0       N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 15)
#define PD01_REMAP1       N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 15)
#define TIM5CH4_REMAP0    N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 16)
#define TIM5CH4_REMAP1    N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 16)
#define ADC1_ETRI_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 17)
#define ADC1_ETRI_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 17)
#define ADC1_ETRR_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 18)
#define ADC1_ETRR_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 18)
#define ADC2_ETRI_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 19)
#define ADC2_ETRI_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 19)
#define ADC2_ETRR_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 20)
#define ADC2_ETRR_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 20)
#define MII_RMII_SEL_REMAP0 N32G45X_REMAP(0, 0, N32G45X_RMP_CFG, 23)
#define MII_RMII_SEL_REMAP1 N32G45X_REMAP(1, 0, N32G45X_RMP_CFG, 23)

/*
 * Remap opcodes for AFIO_RMP_CFG3, defined in bit order
 * (bit 0, 1, 4, 6, 8, 10, 12, 14, 16, 18, 19, 20, 22, 24, 26, 30).
 * Bits 18 (SPI1_RMP_1) and 19 (USART2_RMP_1) are the high halves of the
 * split SPI1/USART2 remap fields, encoded in the SPI1_REMAPx and
 * USART2_REMAPx constants.
 */
#define SDIO_REMAP0       N32G45X_REMAP(0, 0, N32G45X_RMP_CFG3, 0)
#define SDIO_REMAP1       N32G45X_REMAP(1, 0, N32G45X_RMP_CFG3, 0)
#define CAN2_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 1)
#define CAN2_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 1)
#define CAN2_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 1)
#define QSPI_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 4)
#define QSPI_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 4)
#define QSPI_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 4)
#define I2C2_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 6)
#define I2C2_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 6)
#define I2C2_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 6)
#define I2C3_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 8)
#define I2C3_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 8)
#define I2C3_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 8)
#define I2C4_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 10)
#define I2C4_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 10)
#define I2C4_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 10)
#define SPI2_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 12)
#define SPI2_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 12)
#define SPI2_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 12)
#define SPI3_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 14)
#define SPI3_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 14)
#define SPI3_REMAP2       N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 14)
#define SPI3_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 14)
#define ETH_REMAP0        N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 16)
#define ETH_REMAP1        N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 16)
#define ETH_REMAP2        N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 16)
#define ETH_REMAP3        N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 16)
#define UART4_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 20)
#define UART4_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 20)
#define UART4_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 20)
#define UART4_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 20)
#define UART5_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 22)
#define UART5_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 22)
#define UART5_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 22)
#define UART5_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 22)
#define UART6_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 24)
#define UART6_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG3, 24)
#define UART6_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 24)
#define UART7_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 26)
#define UART7_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 26)
#define UART7_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 26)
#define TIM8_REMAP0       N32G45X_REMAP(0, 1, N32G45X_RMP_CFG3, 30)
#define TIM8_REMAP1       N32G45X_REMAP(1, 1, N32G45X_RMP_CFG3, 30)
#define TIM8_REMAP3       N32G45X_REMAP(3, 1, N32G45X_RMP_CFG3, 30)

/*
 * Remap opcodes for AFIO_RMP_CFG4, defined in bit order
 * (bit 0, 2, 4, 6, 8, 10, 12, 14, 15, 16, 17, 19, 20, 22, 23, 24, 25).
 */
#define COMP1_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 0)
#define COMP1_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 0)
#define COMP1_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG4, 0)
#define COMP1_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 0)
#define COMP2_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 2)
#define COMP2_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 2)
#define COMP2_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG4, 2)
#define COMP2_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 2)
#define COMP3_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 4)
#define COMP3_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 4)
#define COMP3_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 4)
#define COMP4_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 6)
#define COMP4_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 6)
#define COMP4_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 6)
#define COMP5_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 8)
#define COMP5_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 8)
#define COMP5_REMAP2      N32G45X_REMAP(2, 1, N32G45X_RMP_CFG4, 8)
#define COMP5_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 8)
#define COMP6_REMAP0      N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 10)
#define COMP6_REMAP1      N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 10)
#define COMP6_REMAP3      N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 10)
#define COMP7_REMAP0      N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 12)
#define COMP7_REMAP1      N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 12)
#define ADC3_ETRI_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 14)
#define ADC3_ETRI_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 14)
#define ADC3_ETRR_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 15)
#define ADC3_ETRR_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 15)
#define ADC4_ETRI_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 16)
#define ADC4_ETRI_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 16)
#define ADC4_ETRR_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 17)
#define ADC4_ETRR_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 17)
#define QSPI_XIP_EN_REMAP0 N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 19)
#define QSPI_XIP_EN_REMAP1 N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 19)
#define DVP_REMAP0        N32G45X_REMAP(0, 1, N32G45X_RMP_CFG4, 20)
#define DVP_REMAP1        N32G45X_REMAP(1, 1, N32G45X_RMP_CFG4, 20)
#define DVP_REMAP3        N32G45X_REMAP(3, 1, N32G45X_RMP_CFG4, 20)
#define SPI1_NSS_REMAP0   N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 22)
#define SPI1_NSS_REMAP1   N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 22)
#define SPI2_NSS_REMAP0   N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 23)
#define SPI2_NSS_REMAP1   N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 23)
#define SPI3_NSS_REMAP0   N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 24)
#define SPI3_NSS_REMAP1   N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 24)
#define QSPI_MISO_REMAP0  N32G45X_REMAP(0, 0, N32G45X_RMP_CFG4, 25)
#define QSPI_MISO_REMAP1  N32G45X_REMAP(1, 0, N32G45X_RMP_CFG4, 25)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_N32G45X_PINCTRL_H_ */
